# Module 2 Exercises - Explore Data

In [1]:
#import libraries
import pandas as pd
import numpy as np

### Exercise 1:
Use the pandas library to read in the file "travel-times.csv" as a dataframe. Set the dataframe's variable name as "travel_df".

*Note*: Download the file from [here](https://notebooks.azure.com/priesterkc/projects/DABmaterial/tree/Lv1%20Data%20Analytics/datasets).

In [3]:
location = "datasets/datasets_travel-times.csv"
travel_df = pd.read_csv(location)
travel_df.head()

,Date,StartTime,DayOfWeek,GoingTo,Distance,MaxSpeed,AvgSpeed,AvgMovingSpeed,FuelEconomy,TotalTime,MovingTime,Take407All,Comments
0,1/6/2012,16:37,Friday,Home,51.29,127.4,78.3,84.8,NaN,39.3,36.3,No,NaN
1,1/6/2012,08:20,Friday,GSK,51.63,130.3,81.8,88.9,NaN,37.9,34.9,No,NaN
2,1/4/2012,16:17,Wednesday,Home,51.27,127.4,82.0,85.8,NaN,37.5,35.9,No,NaN
3,1/4/2012,07:53,Wednesday,GSK,49.17,132.3,74.2,82.9,NaN,39.8,35.6,No,NaN
4,1/3/2012,18:57,Tuesday,Home,51.15,136.2,83.4,88.1,NaN,36.8,34.8,No,NaN

### Exercise 2:

Use the pandas library to read in the file "income_expenses.xlsx" as a dataframe. Set the dataframe's variable name as "expense_df".

*Note*: Download the file from [here](https://notebooks.azure.com/priesterkc/projects/DABmaterial/tree/Lv1%20Data%20Analytics/datasets).

In [8]:
location = "datasets/datasets_income_expenses.xlsx"
expense_df = pd.read_excel(location)
expense_df.head()

  Income Range                    Category  Amount Class_level
0     $100-200                        Rent   26.43        Poor
1     $100-200                        Food   59.81        Poor
2     $100-200                     Clothes   38.95        Poor
3     $100-200                       Taxes    0.14        Poor
4     $100-200  Other Expenses and Savings   13.77        Poor

### Exercise 3:
Using the lists in the cell below, write code that will zip up the lists and make them into one list, then turn it into a dataframe. Next, export the dataframe as a csv file. Then try exporting the dataframe as an Excel file.

In [9]:
names = ['Nike','Adidas','New Balance','Puma','Reebok']
grades = [176,59,47,38,99]

In [11]:
gradeList = list(zip(names,grades))
df = pd.DataFrame(data = gradeList, columns=['Names', 'Grades'])
writer = pd.ExcelWriter('datasets/grades_dataset.xlsx', engine='xlsxwriter')
df.to_excel(writer)
writer.save()
df.head()

         Names  Grades
0         Nike     176
1       Adidas      59
2  New Balance      47
3         Puma      38
4       Reebok      99

### Exercise 4:

What columns are in the travel_df dataframe? What columns are in the expense_df dataframe?

In [17]:
travel_df.columns

Index(['Date', 'StartTime', 'DayOfWeek', 'GoingTo', 'Distance', 'MaxSpeed',
       'AvgSpeed', 'AvgMovingSpeed', 'FuelEconomy', 'TotalTime', 'MovingTime',
       'Take407All', 'Comments'],
      dtype='object')

In [13]:
expense_df.columns

Index(['Income Range', 'Category', 'Amount', 'Class_level'], dtype='object')

### Exercise 5:

Using the expense_df dataframe, sum the expense amount using the group_by function by income range.

In [20]:
expense_df[['Amount']].groupby(expense_df['Income Range']).sum()

               Amount
Income Range
$100-200       139.10
$1000+        1125.00
$200-300       249.45
$300-400       335.68
$400-500       433.82
$500-750       557.00
$750-1000      880.00

### Exercise 6:

Using the travel_df dataframe and pivot_table function, get the average total time by day of the week and direction traveled (Home/GSK).

In [30]:
#travel_df.head()
pd.pivot_table(travel_df, values=['TotalTime'], index=['DayOfWeek', 'GoingTo'])

                   TotalTime
DayOfWeek GoingTo
Friday    GSK      37.628571
          Home     38.238462
Monday    GSK      44.747368
          Home     41.725000
Thursday  GSK      40.204167
          Home     42.345000
Tuesday   GSK      42.079167
          Home     42.962500
Wednesday GSK      42.087500
          Home     44.300000

### Exercise 7:

Choose either the travel_df or expense_df and do some exploratory analysis.

In [58]:
# Find total missing values
travel_df.isnull().sum()

# Show rows with missing values for Fuel Economy
missing_fuel_economy = travel_df['FuelEconomy'].isnull()
travel_df.loc[missing_fuel_economy]

# Show rows with missing values for Comments
missing_comments = travel_df['Comments'].isnull()
travel_df.loc[missing_comments]

# Find row with highest distance.
travel_df.loc[travel_df['Distance'].idxmax()]

# Find average speed when going to a specific place.
travel_df.groupby('GoingTo')['AvgSpeed'].mean()

#travel_df.loc[(travel_df['FuelEconomy'] >= 25) & (travel_df['FuelEconomy'].notnull())]
#travel_df.head()
#travel_df.dtypes

GoingTo
GSK     74.73619
Home    74.20600
Name: AvgSpeed, dtype: float64

In [59]:
colA = [10, 20, 40, 50]
colB = ['no', 'yes', 'yes', 'no']
index = ['a', 'b', 'c', 'd']
A_B = list(zip(colA, colB))
df_B = pd.DataFrame(data=A_B, columns=['A', 'B'], index=index)
df_B

    A    B
a  10   no
b  20  yes
c  40  yes
d  50   no

In [64]:
df_B.loc['c']

A     40
B    yes
Name: c, dtype: object

In [65]:
names = ['Bob', 'Jen', 'Rob', 'Sue']
age = [15, 14, 17, 16]
index = [0, 1, 2, 3]
names_age = list(zip(names, age))
df_names_age = pd.DataFrame(data=names_age, columns=['Names', 'Age'], index=index)
df_names_age

  Names  Age
0   Bob   15
1   Jen   14
2   Rob   17
3   Sue   16

In [66]:
df_names_age['Grades'] = 100

In [67]:
df_names_age

  Names  Age  Grades
0   Bob   15     100
1   Jen   14     100
2   Rob   17     100
3   Sue   16     100

In [68]:
df_names_age.dtypes

Names     object
Age        int64
Grades     int64
dtype: object

In [69]:
names=['Jessica', 'John', 'Bob', 'Jessica', 'Mary', 'John', 'Mel', 'Mel']
grades=[95,78,76,95,77,78,99,100]
index=[0,1,2,3,4,5,6,7]
df = pd.DataFrame(data=list(zip(names,grades)), columns=['Names', 'Grades'], index=index)
df

     Names  Grades
0  Jessica      95
1     John      78
2      Bob      76
3  Jessica      95
4     Mary      77
5     John      78
6      Mel      99
7      Mel     100

In [70]:
df.loc[df['Names'] == 'Mel']

  Names  Grades
6   Mel      99
7   Mel     100